[
  {
    "description": "$2,200/mo 2 Bed, 1 Bath, 1 covered carport - Max of 4 occupants. \nVery spacious 1098+ sqft, 1 Bedroom 1 Bathroom apartment (optional extra room). New paint throughout, beautiful hardwood and laminate floor, charming original built-ins in living room and formal dining, beautiful wood framing around windows. Washer/dryer hookups in unit. \n\nPrime location conveniently close to USC, Exposition Park, home of the Los Angeles Memorial Coliseum, Natural History Museum and the Banc of California stadium. Easy freeway access, and only a few miles from LA Live and the Staples Center, and 10 minutes to Santa Monica Beach or Hollywood\n\nDescription:\n- 1098 sq. ft.\n- 2 bedroom, 1 bathroom \n- Washer/dryer hookup in unit (appliances not included)\n- One covered carport parking space included\n- Easy access to the 10 & 110 and Exposition Metro Line\n- Move-In Ready!\n\nRequirements: \n- Application fee: All adult applicants must complete a Zillow application (includes credit and background check) \n- Proof of Income 2.5x rent (past 3 mos check stubs for all applicants)\n- Proof of Assets minimum balance 3x rent (past 3 mos bank statements) \n- Minimum Credit Score: 620 \n- 1-year lease\n- Renter pays for utilities, except water.\n- No pets allowed\n- No smoking",
    "price": 2300,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "835 W 41st St #1/2",
    "distance": 0.9180956932985994,
    "topPicture": "https://photos.zillowstatic.com/fp/f507e7a8dc18aacc616f11dabe82f80b-p_b.jpg"
  },
  {
    "description": "Modern contemporary 3 story townhouse style unit (Unit Number 1233). Construction completed in May 2020. Designated, Tandem parking spaces. Stainless steel refrigerator, stove, dishwasher and microwave hood. In unit washer and dryer. All bathrooms have tile enclosures and tile floors. Central air condition and heating. All rooms are en suite. This property is located near USC and a great option for offsite student housing. Close proximity to the metro/metro rail, Korea town, DTLA. Unit is separately metered for water, gas, and electricity. Small private lawn area for this unit in the back. *This unit is different from 1233 1/2 W 39Th Pl.",
    "price": 3895,
    "bedrooms": 3,
    "bathrooms": 3.5,
    "streetAddress": "1233 W 39th Pl UNIT 1233",
    "distance": 0.9447083939086598,
    "topPicture": "https://photos.zillowstatic.com/fp/a29441f8015acd09c25ac80de8c13c51-p_b.jpg"
  },
  {
    "description": "FIRST TWO WEEKS FREE! Brand new 2 story condo features 3 bed /3 1/2 bath 1850 Sq feet. CONDO IS PERFECT FOR USC STUDENTS The kitchen in this condo is so spacious it's like a dream come true!. Endless Modern countertops and cabinets with chrome Fixtures.Laundry room is located on the first floor next to the bathroom the dining room is very spacious just like the long spacious living room, the condo features a Very modern look and feel starting from the front door all around The bathroom features very modern looking tile step in showers with glass sliding doors. with a very good size vanity mirrors each room has its own bathroom two of the bedrooms have a mirror sliding closet doors and the master has the walk in closet. the bedrooms have carpet flooring.The balcony has a street view and the balcony space is big enough to have a table with chairs to enjoy your the morning coffee and or a glass of wine at the end of the day.very convenient for students or new faculty of U.S.C because we are in free LYFT zone\n\n1 YEAR LEASE 1 MONTH RENT 1MONTH SECURITY DEPOSIT REQURED UPON APPROVAL.",
    "price": 4350,
    "bedrooms": 3,
    "bathrooms": 3.5,
    "streetAddress": "3901 Wisconsin Pl #1",
    "distance": 0.6863926313329388,
    "topPicture": "https://photos.zillowstatic.com/fp/73f088707eb26abdf90e9df6e780fb15-p_b.jpg"
  },
  {
    "description": "Unique bungalow offers a comfortable one bedroom/one bathroom unit with laminate flooring throughout and no shared walls. Updated refrigerator, stove, and all utilities are included. This controlled-access property is professionally managed and situated in a truly vibrant and youthful neighborhood within walking distance to USC, the Natural History Museum, and the LA Coliseum. With great accessibility to stores, coffee shops, and diverse restaurants in the area, this property also boasts easy accessibility to a variety of public transportation options, such as walkability to the Expo line stop, as well as being central to the 110 and 10 Freeways. On-site parking is available for $100/mo. Contact us today to schedule your private viewing!\n\nLease is 1 year",
    "price": 1795,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "3812 Wisconsin St APT 8",
    "distance": 0.6076683514092737,
    "topPicture": "https://photos.zillowstatic.com/fp/5d9ec5d59fb7c10db2af2f451a0c06be-p_b.jpg"
  },
  {
    "description": "This property is improved, updated and repainted throughout. New engineered flooring in all rooms except the bathrooms. The bathrooms have new fixtures, tile and vanities. Air conditioning is plumbed and ready to be connected for the summer! Large backyard with new turf front and back is perfect for family entertaining.  There is plenty of room for car parking via the back alley into the property.",
    "price": 5500,
    "bedrooms": 5,
    "bathrooms": 3,
    "streetAddress": "1208 W 38th St",
    "distance": 0.8132325867868415,
    "topPicture": "https://photos.zillowstatic.com/fp/afac7cc76bbe7fa92e5c6b555ec24027-p_b.jpg"
  },
  {
    "description": "Large, fully remodeled, upstairs 1 bedroom, 1 bathroom unit for rent. Blocks from USC, it is within the USC DPS area. Upgrades include updated flooring, bathroom, kitchen cabinets, counter-top, appliances, etc. Unit includes oven, dishwasher, refrigerator and on site laundry. Street parking only. 1 year lease minimum.\n\nOwner pays water and trash. Tenant responsible for their electricity and their gas. Coin operated washers and dryers in building. Gated. Street parking only. 1 year lease minimum. $30 application fee per adult.",
    "price": 1750,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "3111 Kenwood Ave",
    "distance": 0.8617999283999195,
    "topPicture": "https://photos.zillowstatic.com/fp/73ff5c4b407da6ba7be43e56aa7a42cb-p_b.jpg"
  },
  {
    "description": "Open House: Sunday April 21, 2024 from 2:00pm - 3:00pm\n\nCozy Studio down the street from USC Campus. Shared Laundry Room on Site.\nStudio has no furniture. Unit is equipped with wall A/C, wall heater, stove, microwave and refrigerator. *Note Refrigerator is left by previous Tenant and Landlord does not provided warranty*.\n\nShared Laundry Room on site. Street Parking Only.\n\nLandlord pays for Water Only. Tenant is responsible for Electric, Water, Trash & Internet. No Smoking on Site. No Pets. No Parking Space",
    "price": 1450,
    "bedrooms": 0,
    "bathrooms": 1,
    "streetAddress": "1195 W 30th St UNIT 1/2",
    "distance": 0.4290200820980796,
    "topPicture": "https://photos.zillowstatic.com/fp/ea58232513e4afc8e983f18d679064fb-p_b.jpg"
  },
  {
    "description": "Newly renovated one bed apartment\n\nOwner pays for trash, water, and sewer. Smoking is not allowed.",
    "price": 1800,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1425 W Jefferson Blvd #1/2",
    "distance": 0.7645962649205911,
    "topPicture": "https://photos.zillowstatic.com/fp/8a027e43f1a93e4a1c7f340dc90fc897-p_b.jpg"
  },
  {
    "description": "USC walking Distance. The Row Apartments is conveniently located at the entrance of the famous Fraternity Row, adjacent to Study Hall, Tram Stop immediately across the street and is patrolled by USC Campus Security.\n\n \n\nAmenities Included: Hot/Cold Water and Trash, Laundry on premises. Parking Available for a fee, Manager on premises\n\nLandlord pays Water (hot and cold) and Trash. Tenants are responsible to pay for electricity and Internet.",
    "price": 1750,
    "bedrooms": 0,
    "bathrooms": 1,
    "streetAddress": "2815 S Hoover St APT 304",
    "distance": 0.4529368266833376,
    "topPicture": "https://photos.zillowstatic.com/fp/206396fb1b3017265a39a584aa53c4f5-p_b.jpg"
  },
  {
    "description": "STUNNING NEW CONSTRUCTION TOWNHOMES! \n\nSpacious 3 bedroom, 3 bath apartments located minutes away from the USC campus! \n\nThree story units, balcony views, attached two car garage (NO ADDITIONAL FEE), \nlarge closets & private bath in each room. Gated entry. \n\nAll units have smart lock entry, individual climate control in each room, Appliances supplied: washer/dryer, microwave, dishwasher, fridge, stove/oven\n\nPerfect for USC students or professionals who work in the los angeles area! Minutes away from several of Los Angeles' most popular hot spots such as the Crypto.com Arena, Coliseum (USC), Exposition Park, popular restaurants and many more! \n\nConveniently located near several means of transportation; Metro and bus routes. Quick access to 110 freeway \n\n \nWithin USC Patrolled Area/Free Lyft Zone\n\nFor More Information please email/call/text\n\nNo smoking \n\nNo fee for parking \n\nNo utilities included \n\nNo pets",
    "price": 5200,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1220 W 35th St",
    "distance": 0.5832975915001203,
    "topPicture": "https://photos.zillowstatic.com/fp/1a437cef53e7ad55347dc05225788dc6-p_b.jpg"
  },
  {
    "description": "This charming 3 bedroom, 2 bath house with huge backyard is in a centrally located area in Los Angeles. This recently remodeled house features hardwood floors, updated appliances in the kitchen and lots of natural light. In unit laundry and a huge back yard make this the perfect house for a family. You are very close to the EXPO line, USC, Downtown, as well as amazing restaurants and shops.\n\nTenant is responsible for all utilities \nPets are welcome with an additional deposit\nMust have good credit\nIncome needs to be at least 2.5x the rent\nEnough parking for 6 vehicles",
    "price": 3995,
    "bedrooms": 3,
    "bathrooms": 2,
    "streetAddress": "1196 W 38th St",
    "distance": 0.7928061962588117,
    "topPicture": "https://photos.zillowstatic.com/fp/1bf5be84b599567bb2f9ba77341e6ab5-p_b.jpg"
  },
  {
    "description": "Discover the ultimate student living experience at our prime residence, strategically located within the heart of the academic hub. \n\nJust a brief 5-minute stroll to the campus, our fully furnished units offer unparalleled convenience and comfort. With the added luxury of an in-unit washer and dryer, say goodbye to the hassle of laundry trips. Elevate your student life with the perfect blend of accessibility and coziness. Welcome to a living space designed for the modern student where convenience meets comfort effortlessly!\n\nThe listing rate already has a discount applied for the lease term!\n\nWe Offer Virtual Tours!\n\nApplication Fee $35\n12 month lease",
    "price": 2000,
    "bedrooms": 0,
    "bathrooms": 1,
    "streetAddress": "3525 S Budlong Ave #1/2",
    "distance": 0.6429156420180705,
    "topPicture": "https://photos.zillowstatic.com/fp/5325040e537a396b1c3f703a892e2ac8-p_b.jpg"
  },
  {
    "description": "Luxury townhouse style apartment units with balconies in each unit features 3 bedrooms and 3 bathrooms and tons of space. Common area hot tubs for all tenants.\n\nLease Terms: 08/15/2024 to 07/31/2025\nsublease allowed \nparking available for a fee",
    "price": 5750,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "2804 Ellendale Pl APT 2",
    "distance": 0.5136610783701984,
    "topPicture": "https://photos.zillowstatic.com/fp/47e7ded17924a4bec0aae42d32ce426e-p_b.jpg"
  },
  {
    "description": "New 2 story, 3 bedrooms 3 bath unit, available for the fall 2024. Fully furnished with tween bed and computer desk. The unit is located across the street from USC main campus.\nThe unit is also located in the free lift zone and DPS patrol zone. All rooms are equipped with independent AC/heat units. Newer stainless steel kitchen appliances-refrigerator, microwave, dishwasher and gas stove. laminated wood flooring, all bathrooms are remodel including the Kitchen/living room. Bright open space with eight foot ceilings. The House is gated and equipped with automatic gate and 1 parking space included. Washer and dryer in unit. Close to Downtown, Staples center. For enquiries email or call, ask for Gil.\n\nOwner pays for water. The unit is equipped with solar panels.",
    "price": 3850,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1157 1/2 W 37th Dr",
    "distance": 0.5228088900110179,
    "topPicture": "https://photos.zillowstatic.com/fp/82add137ff6636625ea1b2f17c6638c6-p_b.jpg"
  },
  {
    "description": "Sub/lease - Cozy Fully Furnished 2BR/2BA House\n$2800/month for the whole unit OR\nSmaller room $1350/month\nBigger room $1450/month\nSublease maybe extended afterwards.\nRenovated 2 Suites (Private Room, Private Bath)\n10-min Walk to USC Campus \nWithin USC DPS Patrol and Free Lyft Zones\nPrivate AC & Heat in Bedroom\nFull-sized Bed/Mattress, Desk/Chair, Closet\nQuartz Kitchen Counter, Stainless Steel Range/Hood & Microwave\nNewer Flooring, Recessed Lighting\nIn-unit Front Load Washer & Dryer included in lease\nMetro & Bus Stations close by\n\nNo smoking of ANY kind allowed on premises. Gardening is included in rent. Tenant pays for all utilities.",
    "price": 2800,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "1293 W 37th Dr",
    "distance": 0.735425993760612,
    "topPicture": "https://photos.zillowstatic.com/fp/1e3af77dc9898843c444b94f8ca2a8d5-p_b.jpg"
  },
  {
    "description": "Welcome to the ultimate student living experience! This exquisitely remodeled 5 bedroom, 5 bathroom apartment is your gateway to the vibrant USC campus and just steps away from Smart and Final, ensuring all your daily needs are at your doorstep.\n\nStep inside and be enchanted by the modern charm and thoughtful design that awaits you. Each spacious bedroom comes fully furnished with a cozy full bedframe, a sleek desk, and a comfortable chair, providing you with the perfect space to study, relax, and call your own.\n\nWith five private bathrooms, no need to worry about sharing facilities, offering you the utmost convenience and privacy. Embrace the ease of college living, where everything you desire is right within reach.\n\nSituated in the heart of the action, you'll have unparalleled access to all that USC and the surrounding area has to offer. Whether it's attending classes, exploring the campus, or indulging in the local dining scene, you'll be right in the middle of it all.\n\nCome and experience the epitome of modern student living in this beautifully remodeled 5 bedroom, 5 bathroom apartment. Embrace comfort, convenience, and community all in one place - your perfect USC haven awaits!\n\nThe listing rate already has a discount applied for the lease term!\n\nMessage us for more info!\n\nLease Term: August 10, 2024 July 20, 2025",
    "price": 7000,
    "bedrooms": 5,
    "bathrooms": 5,
    "streetAddress": "1205 W 37th Dr",
    "distance": 0.5929036513412994,
    "topPicture": "https://photos.zillowstatic.com/fp/f344fcb8213eea84e1997dc9a9b23f10-p_b.jpg"
  },
  {
    "description": "Welcome to Pegasus Townhomes! We offer 7 individual homes with incredibly high 20 foot ceilings and rooftop decks. Inside each home is a full size dining and living room, 2 stainless steel refrigerators, and an in-unit washer/dryer! These modern rooms are perfect for students, with a private garage and a large driveway in addition to the open street parking. The furnished rooftop deck overlooks all of Los Angeles, including the famous Hollywood Sign!\n\nOne block from USC campus\nTwo blocks away from a shopping center (Smart and Final)\nSteps away from the Metro Line\nInside DPS patrol zone\nRooftop Deck!\nBike parking on site\n\nThe listing rate already has a discount applied for the lease term!\n\nWe Offer Virtual Tours!\n\nMessage us for more info!\n\nApplication Fee - $35.00\nSecurity Deposit - Typically One Month's Rent",
    "price": 10000,
    "bedrooms": 7,
    "bathrooms": 4,
    "streetAddress": "1180 W 37th Pl",
    "distance": 0.5471296964136609,
    "topPicture": "https://photos.zillowstatic.com/fp/73c780ee46fa9e370f3292fcd3a1f3a6-p_b.jpg"
  },
  {
    "description": "Welcome to Pegasus Apartments! We have brand new apartments available! These 2 bedroom 1 bathroom units are a great size and can accommodate 2-3 people. We provide furniture and new appliances for the common area and kitchen as well as an in-unit washer/dryer. Utilities (except wifi) will be managed by us and billed back to you. The apartment's fully furnished rooms and proximity to campus make it a great option for students!\n\nOne block from USC campus\nTwo blocks away from a shopping center (Smart and Final)\nSteps away from the Metro Line\nInside DPS patrol zone\nFully Furnished!\nBike parking on site\n\nThe listing rate already has a discount applied for the lease term!\n\nWe Offer Virtual Tours!\n\nMessage us for more info!\n\nApplication Fee - $35.00\nSecurity Deposit - Typically One Month's Rent",
    "price": 2900,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1180 W 37th Pl #1/2-4.5",
    "distance": 0.5506413915218777,
    "topPicture": "https://photos.zillowstatic.com/fp/6c18545bfe18b6e61ffee5deefa67fcb-p_b.jpg"
  },
  {
    "description": "Remodeled and FURNISHED apartment now pre-leasing near USC for the fall 2024 school year!\n\nUnits are in a secured building just a 5-minute walk away from campus. Located within the Lyft radius, this unit is also just across the street from the USC shuttle stop.\n\nGet in contact with us today to schedule a viewing!\n\nPlease note that all information above is subject to change depending on unit availability. All square footage is estimated and the apartment features are not guaranteed.",
    "price": 2095,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "2816 Ellendale Pl APT 5",
    "distance": 0.5074471080090305,
    "topPicture": "https://photos.zillowstatic.com/fp/3d9d995b63f18f700a58260bfb285f8b-p_b.jpg"
  },
  {
    "description": "1 BED IN PRIME LOCATION - RIGHT NEXT TO USC - AVAILABLE NOW!! This is a vibrant neighborhood characterized by a mix of cultures, with a significant student population due to its proximity to USC. The area boasts diverse dining options, cultural attractions, and a lively atmosphere, making it a dynamic and exciting place to live.Please note: owners will charge the applicable voucher amount.Square footage when listed or from inquiry, is approximate*Pricing is subject to change without notice* For more properties like this visit Affordable Housing.",
    "price": 1745,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "3005 S Normandie Ave APT 6",
    "distance": 0.9415898136554538,
    "topPicture": "https://photos.zillowstatic.com/fp/b5c1768570b53493022fda2a92ac3931-p_b.jpg"
  },
  {
    "description": "Newly Renovated 1 Bedroom Apartment! Handicap friendly bathroom with Doorless shower! Includes Parking Space! Beautifully renovated 1 bedroom/1 bath apartment near USC and the Colosseum. This is great front unit in a small Spanish style building. Bathroom and Kitchen have been newly remodeled. Entire unit has been painted and has brand new flooring. Huge bonus closet in the living area as well as dining space with tons of cabinets for even more storage. Quiet building with monthly pest control very well maintained. This is a beautiful unit and won't last. Section 8 and other housing programs accepted. For more properties like this visit Affordable Housing.",
    "price": 1800,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1105 W 39th St #11055",
    "distance": 0.7162093061905771,
    "topPicture": "https://photos.zillowstatic.com/fp/135476c61c09e814c7a98775efe04cf0-p_b.jpg"
  },
  {
    "description": "Large 2nd Floor Apartment over 1000 SQFT: 1 Bedroom apartment. Is fully furnished. Laminate floors, porcelain tiles, new toilet, vanity sink, shower doors. Refrigerator, microwave and Double Stack Laundry. This property is near the USC patrol area and is a quite street with quite tenants. Property has a look and feel of a New York Apartment. Please contact Landord for questions. For more properties like this visit Affordable Housing.",
    "price": 3010,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "2951 1/2 Kenwood Ave",
    "distance": 0.8872706345528567,
    "topPicture": "https://photos.zillowstatic.com/fp/ee3f193b4dd7670ec51b1cf0f0fabf31-p_b.jpg"
  },
  {
    "description": "This BRAND NEW 3-story townhome-style 6-unit located around walking distance to Exposition Park and USC campus, and also located in USC's free Lyft zone! It is good opportunity for excellent off-campus student housing. looking for a Corporate Master Lease Tenant or individual renters , There are two separated buildings with ROOFTOP DECKS with amazing city views . Front building offer 2 units which each unit is 3 bedrooms + 3.5 bathrooms, and one ADU which is 1 bedroom +1 bath Rear Building offer three units which each unit is 3 bedroom + 3 bathroom. All units have open floor plan , big windows for more natural light, and microwave, refrigerator , washer & dryer all included in each unit, monthly rent will be $4000 for 3 bedroom units and $1800 for 1 bedroom unit",
    "price": 21800,
    "bedrooms": 16,
    "bathrooms": 18,
    "streetAddress": "1260 Leighton Ave",
    "distance": 1.039431725630219,
    "topPicture": "https://photos.zillowstatic.com/fp/f4ebf69670ff1929a40af67c661435cf-p_b.jpg"
  },
  {
    "description": "This small gated building is located within the USC Patrol Zone and only a few blocks from the USC Campus and Exposition Park! It is also centrally located to Downtown LA, Mid-City and the Westside! This adorable apartment home has a beautifully renovated with new cabinets and countertops in the kitchen/bathroom, stainless steel refrigerator/stove/dishwasher, newly installed AC and on-site laundry! This apartment is laid out in a two story townhouse style with the kitchen and living room on the 1st floor and the two bedrooms and bathroom on the 2nd floor, and it comes with one covered/assigned parking space! Apartment has only one shared wall and no neighbors above or below you!",
    "price": 2650,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1119 W Exposition Blvd",
    "distance": 0.6407377645521367,
    "topPicture": "https://photos.zillowstatic.com/fp/5f128398fa5e4595bfe07b006bdba294-p_b.jpg"
  },
  {
    "description": "Top Floor end unit Easy access to freeways and downtown. 20 unit building has freshly painted hallways and floors, street parking, laundry down the street. For more properties like this visit Affordable Housing.",
    "price": 2900,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1321 W Martin Luther King Jr Blvd APT 11",
    "distance": 1.1024158469164311,
    "topPicture": "https://photos.zillowstatic.com/fp/ce8a54d10cf262213307bb30c26e21c0-p_b.jpg"
  },
  {
    "description": "Beautiful Garden Cottage single with extra bonus small room, full kitchen and Bath, all renovated, excellent location close to everywhere, NO PETS NO SMOKING, City of Los Angeles Section 8 Voucher only For more properties like this visit Affordable Housing.",
    "price": 1650,
    "bedrooms": 0,
    "bathrooms": 1,
    "streetAddress": "1219 W Martin Luther King Jr Blvd",
    "distance": 1.0179886970183099,
    "topPicture": "https://photos.zillowstatic.com/fp/57235d4db8e04024a87f2d9258889a27-p_b.jpg"
  },
  {
    "description": "For Rent, back unit 3923 1/4 S. Normandie Ave, Los Angeles, CA 90037. 2 Bedrooms and 2 Bathrooms. Connections for washer and dryer are available. There is no Parking available at this property and Tenants pay for all utilities, (water and sewer is prorated).",
    "price": 2300,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "3923 S Normandie Ave",
    "distance": 1.0460669556482503,
    "topPicture": "https://photos.zillowstatic.com/fp/41519459bd592baf5464c655ef46346d-p_b.jpg"
  },
  {
    "description": "NEW VACANCY:\nSpacious One Bedroom, One Bath apartment minutes away from popular Museum attractions, LA Memorial Coliseum, Banc of California Stadium, USC, and near the 110 fwy entrance. Great Location!\n\nOPEN HOUSE SATURDAY AND SUNDAY FROM 9:00 AM TO 1:00 PM\n\nLISTING INFORMATION\n1345 Martin Luther King Jr. Blvd., Los Angeles, CA 90037\nOne Bedroom | One Bath\nRent: $1695 | Deposit: $1695\nUpstairs Unit | Laminate Floors | Granite Counter top on Kitchen | Stove Included | One Parking Space | Water Paid by Owner | Laundry Room Onsite | One Year Lease | No Pets | \n\nSHOWING:\nWeekdays and Weekends: Please contact the Property Managers Norma or Stephanie to schedule a private tour.\n\nOpen House on Saturday and Sunday: From 9am to 1pm. \n\nCURRENT STATUS: \nThis is a New Vacancy, currently being worked on.\n\nOne Year Lease\nNo Pets\n$40 per application process, per adult (18 and over)",
    "price": 1695,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1345 W Martin Luther King Jr Blvd",
    "distance": 1.1296005034325696,
    "topPicture": "https://photos.zillowstatic.com/fp/84d3d1c04142e7062cfb53899120e737-p_b.jpg"
  },
  {
    "description": "Gorgeous FULLY FURNISHED 3 br 2ba first level unit. Bright and spacious with a lot of closet space. Open kitchen to dining and living area with natural lighting. The unit includes stainless steel refrigerator, dishwasher, oven/range, and microwave. Newer laminate floors in the dining area and all bedrooms. Newer tiles in all bathrooms. Fresh paint, newer kitchen cabinets with large countertops. Recessed lighting throughout the unit. Laundry closet with washer and dryer. Central A/C. 5-min drive distance to USC and USC Village.\n\nCopyright The MLS. All rights reserved. Information is deemed reliable but not guaranteed.",
    "price": 4650,
    "bedrooms": 3,
    "bathrooms": 2,
    "streetAddress": "3915 Brighton Ave",
    "distance": 1.0809426299870002,
    "topPicture": "https://photos.zillowstatic.com/fp/bece067697d683817de752f5a0ee5f26-p_b.jpg"
  },
  {
    "description": "Newly Renovated 2 Bdrm/2bth duplex lots closet space Downstairs unit very large 2 Bdrm with 3 large closets with garbage disposal, central air and heat, washer dryer connection new wood flooring and carpet in bedrooms, ,off street parking, ceiling fans, custom colors. Currently has refrigerator and I can supply stove if needed.",
    "price": 2700,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "1233 W 41st St #1233",
    "distance": 1.1441281016724172,
    "topPicture": "https://photos.zillowstatic.com/fp/e3560bd817a81ed044432edf5c47adc5-p_b.jpg"
  },
  {
    "description": "Beautifully Updated 3 Bedroom available in Los Angeles! Newly updated 3 bedroom apartment is located in Los Angeles For more properties like this visit Affordable Housing.",
    "price": 3995,
    "bedrooms": 3,
    "bathrooms": 1,
    "streetAddress": "3117 Kenwood Ave",
    "distance": 0.8493782959776878,
    "topPicture": "https://photos.zillowstatic.com/fp/14884b4a932d3824e964fbbccee153e4-p_b.jpg"
  },
  {
    "description": "Renovated 1Bed/1Bath, first floor Apartment. Laminate flooring and fresh paint throughout. New kitchen cabinetry and updated bathroom. Unit offers approx 850 sq ft of living space. No laundry on site. STREET PARKING ONLY. Water Included. Will consider 1 small pet. \nCall now- Showings by appointment only. Will not last!",
    "price": 1795,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "2943 Brighton Ave #2939-1/2",
    "distance": 1.021919216847315,
    "topPicture": "https://photos.zillowstatic.com/fp/46f59a738c8f1a04a2353f3b2c5dcb6c-p_b.jpg"
  },
  {
    "description": "CLEAN and WELL MAINTAINED UNIT(SPACIOUS) 1 parking spot included section 8 welcome Very well maintained and clean unit in a small and cozy 5 unit building(so you don't have to deal with tons and tons of neighbors) with parking and storage. Interior and exterior have been updated, New laminate flooring, wood cabinets and ceiling fans and A/C. Close to downtown LA, USC, Convention Center, Staples Center, BMO Stadium, Metro Lines, the 110 freeway and other stores are within walking distance. Thank you. For more properties like this visit Affordable Housing.",
    "price": 2000,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "552 W 40th Pl #552",
    "distance": 0.8385985449091216,
    "topPicture": "https://photos.zillowstatic.com/fp/243e449c5175444c0763d82ab4586caa-p_b.jpg"
  },
  {
    "description": "Premium Apartments at 1317 W Jefferson Blvd Our units feature a vibrant modern design and fully furnished common areas for a comfortable lifestyle. Enjoy the convenience of your own washer/dryer in every unit! Elevate your downtime on our communal sky deck offering breathtaking views of the LA skyline and USC, including a glimpse of the iconic Hollywood sign. With a range of layouts to suit your preferences, our student housing is designed to meet all your needs. For more properties like this visit Affordable Housing.",
    "price": 3052,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "1317 W Jefferson Blvd",
    "distance": 0.6200030800540218,
    "topPicture": "https://photos.zillowstatic.com/fp/223233ff3f020c8f5d7b161984d2f9ab-p_b.jpg"
  },
  {
    "description": "Situated within a leisurely 10-minute stroll from the school, this spacious 4-bedroom, 4-bathroom CO-LIVING house offers an ideal living space. FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, it ensures a hassle-free move-in experience. Notable for its generous communal areas, residents can enjoy ample space for gatherings and relaxation. Abundant natural light floods the interiors, creating a bright and uplifting ambiance.\n\nEach bedroom offers excellent privacy, making it an ideal retreat for residents. Enjoy the convenience of modern living with easy access to amenities and essentials. Experience the perfect balance of spacious communal areas, privacy, and convenience in this charming 4-bedroom house, just a short drive away from the school.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!",
    "price": 1375,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1326 W 35th Pl #5F4221970",
    "distance": 0.7556386502814458,
    "topPicture": "https://photos.zillowstatic.com/fp/53992b5b6359f1467fb4a8a0989410fb-p_b.jpg"
  },
  {
    "description": "Fully remodeled 1bed/1bath apartment in Exposition Park near Historic Adams and USC! This upstairs unit has natural lighting not only from the living room, but from the bedroom as well. Spacious bathroom with a tub and shower combo. Unit comes with a stove in the kitchen. (Tenant is responsible for providing Fridge).\n\nCommunity:\n-Gated underground parking.\n-Community Laundry\n-Two story with stairs and handicap elevator.\n-On-site manager to assist with residents' needs and requests.\n-Gated underground parking(Ask about availability)\n\nTenants pay for Water and all other utilities EXCEPT for trash (owner pays trash).",
    "price": 1895,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "3856 S Normandie Ave #057D27F09",
    "distance": 0.9637659867689683,
    "topPicture": "https://photos.zillowstatic.com/fp/0d3d9338a85f6ed3a81d50c24ab567b7-p_b.jpg"
  },
  {
    "description": "tenant pay all utilities, need renter insurance, if have pet , also pet deposit",
    "price": 4000,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1258 Leighton Ave",
    "distance": 1.0251458971244158,
    "topPicture": "https://photos.zillowstatic.com/fp/b2ae3d5b8b1681d58d03d1184c51a06a-p_b.jpg"
  },
  {
    "description": "Remodeled home with all new appliances. 5-Bedroom with 5-private bathrooms and separate 1-bedroom ADU.\n\nPrivate Bedroom 1: $1,500\nPrivate Bedroom 2: $1,500\nPrivate Bedroom 3: $1,500\nPrivate Bedroom 4: $1,500 or Shared Bedroom 4: $2,000/person\nPrivate Bedroom 5: $1,500 or Shared Bedroom 4: $2,000/person\nPrivate 1-Bedroom ADU: $2,300\n\nAMENITIES:\nFully Furnished\nUtilities Included\nInternet Included\nHousekeeping every other week\nWasher and Dryer onsite\nNew Appliances\nNew Central air conditioning\nNew Hardwood floor\nNew Landscaping and Hardscaping, New vinyl fence gives privacy all throughout the premise.\nCar parking in driveway\n\nLocated in a nicer, safer block very close to USC. You can see USC students walking around. The block has USC Students and families as residents. You can see the Coliseum from the front yard.\n\nUSC students only please.\n\nAll utilities included",
    "price": 7500,
    "bedrooms": 5,
    "bathrooms": 5,
    "streetAddress": "3923 S Budlong Ave",
    "distance": 0.8462073488692379,
    "topPicture": "https://photos.zillowstatic.com/fp/8be38a0d54814b501d679d2a35205561-p_b.jpg"
  },
  {
    "description": "Gorgeous remodel throughout this beautiful home well situated near USC campus. Featuring all Stainless-Steel Appliances and Granite-Style Counter Tops, inside a Custom Kitchen. Hardwood Floors throughout, with Washer and Dryer included. Professionally Managed by Ashland Pacific. For more information contact us or visit our website at ashlandatusc.com - we are happy to assist in any way that we can!\nWhole House Rate Includes:\nRemodeled Throughout\nHardwood Floors\nStainless Appliances\nAir Conditioned\nWasher & Dryer \nProfessionally Managed\nOnline applications, leasing & resident portal after move-in.\n\n12 months",
    "price": 6067,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1223 W 37th Pl #14A6AAECC",
    "distance": 0.6006352422990674,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Brand New Modern Apartment| FULLY FURNISHED | 2 Floors | 5 Bedrooms, 5 Bathrooms\n\nWe are pleased to offer a unique opportunity to lease in our Brand New Modern Private Unit, featuring 5 large bedrooms and 5 full bathrooms. With a prime location and a host of amenities, this is the perfect place for those seeking a dynamic and hassle-free living experience. Our Property contains a gated fence with cameras surrounding the property as well as RING DOORBELL cameras that provide an added layer of safety and surveillance. \nAll units come with the convenience of a fully furnished setup, including living room furniture, dining table, kitchen appliances, washer/dryer and bedroom furniture (FULL SIZE BED AND DESK WITH CHAIR), ALL INCLUDED. \n\nWIFI INCLUDED\nPARKING AVAILABLE\nDOUBLE OCCUPANCY AVAILABLE \n\nBeing 2 blocks from USC campus, it makes the the unit a great option for college roommates.\n \nLeases are available now for Fall Pre-Leasing , allowing you to secure your spot in advance.\n\nContact us today to schedule a tour and secure your new home.",
    "price": 7900,
    "bedrooms": 5,
    "bathrooms": 5,
    "streetAddress": "1269 1/2 W 36th St",
    "distance": 0.6615254788689575,
    "topPicture": "https://photos.zillowstatic.com/fp/9ef479deeb7baef12a683d61c3addd74-p_b.jpg"
  },
  {
    "description": "Brand New Modern Apartment| FULLY FURNISHED | 2 Floors | 3 Bedrooms, 3 Bathrooms\n\nWe are pleased to offer a unique opportunity to lease in our Brand New Modern Private Unit, featuring 3 LARGE bedrooms and 3 full bathrooms. With a prime location and a host of amenities, this is the perfect place for those seeking a dynamic and hassle-free living experience. Our Property contains a gated fence with cameras surrounding the property that provide an added layer of safety and surveillance. \nAll units come with the convenience of a fully furnished setup, including living room furniture (COUCH, COFFEE TABLES AND TV), dining table, kitchen appliances, washer/dryer and bedroom furniture (FULL SIZE BED AND DESK WITH CHAIR), ALL INCLUDED. \n\nWIFI INCLUDED\nPARKING AVAILABLE\nDOUBLE OCCUPANCY AVAILABLE \n\nBeing 2 blocks from USC campus, it makes the the unit a great option for college roommates.\n \nLeases are available now for Fall Pre-Leasing , allowing you to secure your spot in advance.\n\nContact us today to schedule a tour and secure your new home.",
    "price": 4950,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1271 W 36th St",
    "distance": 0.6654649454576271,
    "topPicture": "https://photos.zillowstatic.com/fp/f8a35de17f0be9c545e7021997b528e0-p_b.jpg"
  },
  {
    "description": "Just a 8-minute walk from USC, this FULLY FURNISHED apartment offers a private and tranquil living experience with 4 bedrooms and 4 bathrooms. Our apartment comes fully furnished with essential items such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, ensuring a hassle-free move-in experience. The bedrooms are generously spacious, providing you with ample personal space. Experience the convenience of proximity to USC and this well-designed space with great price and privacy.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 6400,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "3439 S Catalina St #3",
    "distance": 0.5293223287711213,
    "topPicture": "https://photos.zillowstatic.com/fp/a2ba12e821e53cbde3130cbc9a1c89c5-p_b.jpg"
  },
  {
    "description": "This charming CO-LIVING house, nestled in the DPS area, is just an 8-minute walk from the campus. Featuring 4 bedrooms and 4 bathrooms, it offers a cozy yet spacious living environment. FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, it ensures a hassle-free move-in experience. Notable for its generous communal spaces, residents can enjoy ample room for gatherings and relaxation. Abundant natural light floods the interiors, creating a bright and uplifting atmosphere.\n\nDespite its compact layout, each bedroom offers excellent privacy, providing residents with a tranquil retreat. With convenience at its core, this house offers a comfortable and practical living experience. Experience the perfect blend of spacious communal areas, privacy, and convenience in this charming 4-bedroom house, just a short walk away from campus.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 6300,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1256 W 37th St #3",
    "distance": 0.6495051730482537,
    "topPicture": "https://photos.zillowstatic.com/fp/0eb3a5fc7a3950ba11658f9bc4d67524-p_b.jpg"
  },
  {
    "description": "Located within 10 min walk to USC, this FULLY-FURNISHED CO-LIVING apartment offers an ideal living space with 4 bedrooms and 4 bathrooms, making it an great choice for those looking to share a living arrangement with friends. Our apartment comes fully furnished with essential items such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more. Enjoy the abundance of natural light in each room, and experience the convenience of having your own private bedroom and bathroom. Notable features include the presence of a dishwasher in the kitchen, making daily chores hassle-free. Don't miss the opportunity to reside in this well-lit, well-equipped co-living space near USC. \n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 5935,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "3808 S Budlong Ave #3",
    "distance": 0.719107546448275,
    "topPicture": "https://photos.zillowstatic.com/fp/6057421a90dda7c22f4012b5e07d707f-p_b.jpg"
  },
  {
    "description": "This charming CO-LIVING house, nestled in the DPS area, is just an 8-minute walk from the campus. Featuring 3 bedrooms and 3 bathrooms, it offers a cozy yet spacious living environment. FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, it ensures a hassle-free move-in experience. Notable for its generous communal spaces, residents can enjoy ample room for gatherings and relaxation. Abundant natural light floods the interiors, creating a bright and uplifting atmosphere.\n\nDespite its compact layout, each bedroom offers excellent privacy, providing residents with a tranquil retreat. With convenience at its core, this house offers a comfortable and practical living experience. Experience the perfect blend of spacious communal areas, privacy, and convenience in this charming 3-bedroom house, just a short walk away from campus.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 4950,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1254 W 37th St #3",
    "distance": 0.6437923701811071,
    "topPicture": "https://photos.zillowstatic.com/fp/fe68160215c1c2742b0266ae0dd27e62-p_b.jpg"
  },
  {
    "description": "Located in USC DPS area and just a 5-minute walk from USC, this FULLY-FURNISHED co-living apartment features 4 bedrooms and 2 bathrooms, fully furnished with beds, desks, kitchen appliances, washer&dryer, living room furnitures and more. Enjoy abundant natural light and open atmosphere. With a focus on cost-effectiveness, this space offers high value, making it an ideal choice for comfortable living near USC. \nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 5600,
    "bedrooms": 4,
    "bathrooms": 2,
    "streetAddress": "1137 W 37th St #3",
    "distance": 0.44492667811792175,
    "topPicture": "https://photos.zillowstatic.com/fp/79c53e66ae9be94a1d9403070919708e-p_b.jpg"
  },
  {
    "description": "Located within 10 min walk to USC, this FULLY-FURNISHED CO-LIVING apartment offers an ideal living space with 4 bedrooms and 4 bathrooms, making it an great choice for those looking to share a living arrangement with friends. Our apartment comes fully furnished with essential items such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more. Enjoy the abundance of natural light in each room, and experience the convenience of having your own private bedroom and bathroom. Notable features include the presence of a dishwasher in the kitchen, making daily chores hassle-free. Don't miss the opportunity to reside in this well-lit, well-equipped co-living space near USC. \n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 5935,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1138 W 38th St #3",
    "distance": 0.70998938231041,
    "topPicture": "https://photos.zillowstatic.com/fp/6057421a90dda7c22f4012b5e07d707f-p_b.jpg"
  },
  {
    "description": "Located just a 5-minute walk from the school, this spacious CO-LIVING house offers 10 bedrooms and 10 bathrooms, providing ample living space for residents. FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, it ensures a hassle-free move-in experience.The highlight of this property is its expansive communal areas, offering plenty of room for gatherings and relaxation. With abundant natural light streaming in, the house creates a bright and inviting atmosphere throughout.\n\nThe close proximity to the school adds to the convenience of living here, making it an ideal choice for students or faculty members. Experience the perfect balance of spacious communal areas, comfort, and convenience in this charming 10-bedroom house, just a short walk away from campus.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 15070,
    "bedrooms": 10,
    "bathrooms": 10,
    "streetAddress": "1188 W 37th Pl #3",
    "distance": 0.5739844307529643,
    "topPicture": "https://photos.zillowstatic.com/fp/7b4d34cd97d514542e467c24a826b7b8-p_b.jpg"
  },
  {
    "description": " This home is located at 3739 S Catalina St #3, Los Angeles, CA 90007.",
    "price": 14580,
    "bedrooms": 10,
    "bathrooms": 10,
    "streetAddress": "3739 S Catalina St #3",
    "distance": 0.5764275418402319,
    "topPicture": "https://maps.googleapis.com/maps/api/streetview?location=3739+S+Catalina+St%2C+Los+Angeles%2C+CA+90007&size=101x76&key=AIzaSyARFMLB1na-BBWf7_R3-5YOQQaHqEJf6RQ&source=outdoor&&signature=I6dnBOzDqcHiXoG5SiV9Kl44sr0="
  },
  {
    "description": "Nestled in the USC DPS area, this co-living house offers unparalleled convenience with just a 10-minute walk to the campus. Featuring 3 bedrooms and 3 bathrooms, this residence is FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, ensuring a hassle-free move-in experience. The common areas and bedrooms are surprisingly spacious, providing residents with ample room to live comfortably. Experience the perfect blend of proximity to USC and the spacious yet cozy design of this 3-bedroom co-living house. \n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 4950,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "3507 S Budlong Ave #3",
    "distance": 0.648188176995682,
    "topPicture": "https://photos.zillowstatic.com/fp/ed57da6e6d2e6d4c4ee12dfd79249e6d-p_b.jpg"
  },
  {
    "description": "Situated within a leisurely 15-minute stroll from the school, this spacious 4-bedroom, 4-bathroom CO-LIVING house offers an ideal living space. FULLY FURNISHED with a complete set of furniture such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, it ensures a hassle-free move-in experience. Notable for its generous communal areas, residents can enjoy ample space for gatherings and relaxation. Abundant natural light floods the interiors, creating a bright and uplifting ambiance.\n\nEach bedroom offers excellent privacy, making it an ideal retreat for residents. Enjoy the convenience of modern living with easy access to amenities and essentials. Experience the perfect balance of spacious communal areas, privacy, and convenience in this charming 4-bedroom house, just a short drive away from the school.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\n\nOur property: All furnished, bed mattress desk chair sofa and dinning table!\n\nThe utilities will be split by tenants! The utilities (including monthly cleaning for common area, Wi-Fi, gas, electricity, water and trash) is usually 50-100 per month\n\nThe application fee (including screening) is a onetime charge non refundable $45 lease term Now-7/25/24",
    "price": 4950,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1421 W 35th St #1/4",
    "distance": 0.9221569248388551,
    "topPicture": "https://photos.zillowstatic.com/fp/2f68312bf56148a469913f12a6a2cdaf-p_b.jpg"
  },
  {
    "description": " This home is located at 1297 W 36th St FLOOR 3, Los Angeles, CA 90007.",
    "price": 9850,
    "bedrooms": 7,
    "bathrooms": 7,
    "streetAddress": "1297 W 36th St FLOOR 3",
    "distance": 0.7062915532700523,
    "topPicture": "https://maps.googleapis.com/maps/api/streetview?location=1297+W+36th+St%2C+Los+Angeles%2C+CA+90007&size=101x76&key=AIzaSyARFMLB1na-BBWf7_R3-5YOQQaHqEJf6RQ&source=outdoor&&signature=xMpT7U8Qvhk1P4i4tb123LrHdoY="
  },
  {
    "description": "NEW CONSTRUCTION UNITS! \n\nWelcome to your luxurious three-story apartment, conveniently located minutes away from the USC campus! \n\nYou'll love the balcony views of DTLA, attached two-car garage (yes, it's included at no extra charge!). Large mirrored closets and a private bath in each room. \n\nForget about old-school keys these units feature smart lock entry for added convenience! We've got you covered with all the appliances you need, from washer/dryer to microwave, dishwasher, fridge (filtered water), and stove/oven.\n\nWhether you're hitting the books or exploring LA's hottest spots, you're in the heart of the action. Just minutes away from Crypto.com Arena, Coliseum (go Trojans!), Exposition Park, and tons of delicious restaurants. Quick access to the metro, bus and 110 freeway! \n\nBest of all, these units are within the USC Patrolled Area/Free Lyft Zone!\nFurnished and Unfurnished options available \n\nContact us today!\n\nNo Smoking. No Utilities Included. No Pets.",
    "price": 4950,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1220 W 35th St #2",
    "distance": 0.5841793614252718,
    "topPicture": "https://photos.zillowstatic.com/fp/ee043630a9e985c542ec64f6a3d630f4-p_b.jpg"
  },
  {
    "description": " This home is located at 1271 W 39th Pl #7, Los Angeles, CA 90037.",
    "price": 3500,
    "bedrooms": 3,
    "bathrooms": 2.5,
    "streetAddress": "1271 W 39th Pl #7",
    "distance": 0.9876580910691719,
    "topPicture": "https://maps.googleapis.com/maps/api/streetview?location=1271+W+39th+Pl%2C+Los+Angeles%2C+CA+90037&size=101x76&key=AIzaSyARFMLB1na-BBWf7_R3-5YOQQaHqEJf6RQ&source=outdoor&&signature=Dbv8YxQTM9zAwW4wyx2rdfGKuz4="
  },
  {
    "description": "This 3114 square foot apartment home has 5 bedrooms and 5.0 bathrooms. This home is located at 3003 Van Buren Pl #3, Los Angeles, CA 90007.",
    "price": 7575,
    "bedrooms": 5,
    "bathrooms": 5,
    "streetAddress": "3003 Van Buren Pl #3",
    "distance": 0.7574037176263734,
    "topPicture": "https://photos.zillowstatic.com/fp/0009d6f4f1558623b866869dcfef5bce-p_b.jpg"
  },
  {
    "description": "BEAUTIFUL UPGRADED FURNISHED HOME. It is a fantastic opportunity to rent a home within walking distance from USC. Upgrades include a Bathroom and Bedroom, kitchen with granite countertop home, AC mini-splits, double pane windows, and more. The house is fenced near Exposition Park, Museums, LA Stadium, Coliseum, metro rail stations, and downtown. The property is in the Patrol Boundary of the USC Department of Public Safety/University Park Task Force Patrol & Response! Well maintained in excellent condition. It is ideal for a person or couple working downtown, USC staff, or students. The pet is okay.\n\nMonth to month",
    "price": 2990,
    "bedrooms": 1,
    "bathrooms": 1.5,
    "streetAddress": "1514 W 30th St",
    "distance": 0.789729131695179,
    "topPicture": "https://photos.zillowstatic.com/fp/3c6b225b6bf83645abd608d699bea4cd-p_b.jpg"
  },
  {
    "description": " This home is located at 1421 W 35th St #4, Los Angeles, CA 90018.",
    "price": 5100,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1421 W 35th St #4",
    "distance": 0.9215331191025328,
    "topPicture": "https://maps.googleapis.com/maps/api/streetview?location=1421+W+35th+St%2C+Los+Angeles%2C+CA+90018&size=101x76&key=AIzaSyARFMLB1na-BBWf7_R3-5YOQQaHqEJf6RQ&source=outdoor&&signature=a6sbyTrzZZuLtCHF95KXYpAshgA="
  },
  {
    "description": "Perfect three bedroom just a half mile from USC campus and inside the DPS zone! Large downstairs common area with an open kitchen space and spacious living room that includes built in storage shelving. Hardwood floors throughout this whole townhome and full bathrooms included with every large bedroom. Don't miss out! Contact us for a tour or apply online today!\n\nProperty is professionally managed by Ashland Pacific Management. Ashland Pacific is an equal opportunity housing provider. We adhere to the Fair Housing Act and all applicable federal, state, and local anti-discrimination laws. We do not discriminate based on race, color, religion, sex, national origin, disability, familial status, sexual orientation, or gender identity. All applicants are subject to our standard Rental Criteria, available upon request, prior to application submission. Come Experience the Ashland Difference, and experience - Life at Ease.\n\n12 Month lease, Guarantor Options Available",
    "price": 5336,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1245 W 37th Dr",
    "distance": 0.6544253492309366,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Perfectly located three bedroom townhouse just half a mile from USC Campus and inside the DPS Zone! Open Kitchen and Living areas with plenty of space and hardwood throughout. All bedrooms include attached bathrooms. Dont' miss out - contact us for a tour or apply online today!\n\nProperty is professionally managed by Ashland Pacific Management. Ashland Pacific is an equal opportunity housing provider. We adhere to the Fair Housing Act and all applicable federal, state, and local anti-discrimination laws. We do not discriminate based on race, color, religion, sex, national origin, disability, familial status, sexual orientation, or gender identity. All applicants are subject to our standard Rental Criteria, available upon request, prior to application submission. Come Experience the Ashland Difference, and experience - Life at Ease.\n\n12 Month Lease Terms, Guarantor Options Available",
    "price": 5384,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1225 W 37th Pl",
    "distance": 0.6006786883816234,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Gorgeous remodel throughout this beautiful home well situated near USC campus. Featuring New Appliances and Granite-Style Counter Tops, inside a Custom Kitchen. Hardwood Floors throughout, with Washer and Dryer included. Professionally Managed by Ashland Pacific. For more information contact us or visit our website at ashlandatusc.com - we are happy to assist in any way that we can!\nWhole House Rate Includes:\nRemodeled Throughout\nHardwood Floors\nAir Conditioned\nWasher & Dryer \nProfessionally Managed\nOnline applications, leasing & resident portal after move-in.\n\nAll applicants are required to meet the same Rental Qualification Standards, provide proof of income and standard on-month deposit (maximum two-month deposit) to hold space. Lease document must be signed within 5 days of application approval and deposit paid, in order to hold property till move-in day. Failure to meet required terms will result in property being relisted.\n\n12 month lease. Guarantor Options Available.",
    "price": 8997,
    "bedrooms": 5,
    "bathrooms": 4,
    "streetAddress": "1279 W 37th Pl #BEB0F707E",
    "distance": 0.6914373484831556,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Available August 2024: Beautiful newly constructed townhouse with open downstairs floor plan featuring all hardwood floors throughout! Three Bedrooms and three full private bathrooms for ideal comfort and space. Large kitchen with plenty of cabinets and counter space and all white appliances. Within minutes to USC Campus. Professionally Managed by Ashland Pacific. Ashland offers online applications and leasing, with multiple electronic payment options for your convenience. Our team is dedicated to your comfort and care, from start to finish! Come experience the difference, The Ashland Difference - and experience Life at Ease.\n\n12 Month Lease, Guarantor Options as needed.",
    "price": 5283,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1227 W 37th Pl #25FCE0EDC",
    "distance": 0.6023443932121949,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Well Located and newly renovated four bedroom home close to USC campus. Every room has a private bathroom and Washer/Dryer is included. Central A/C and Heat. \nLocated within the DPS Patrol and Free Lyft Zones.\n\nProperty is professionally managed by Ashland Pacific Management. Ashland Pacific is an equal opportunity housing provider. We adhere to the Fair Housing Act and all applicable federal, state, and local anti-discrimination laws. We do not discriminate based on race, color, religion, sex, national origin, disability, familial status, sexual orientation, or gender identity. All applicants are subject to our standard Rental Criteria, available upon request, prior to application submission. Come Experience the Ashland Difference, and experience - Life at Ease.\n\n12 Month Lease with Guarantor Options Available",
    "price": 6701,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1247 W 37th Dr",
    "distance": 0.6546025975352867,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "Beautiful home - well situated less than a mile from USC campus and within the DPS zone. Hardwood Floors throughout, with Washer and Dryer included. Large bedrooms with a bathroom included for each one - you won't want to miss out on this perfect floor plan!\n\nProperty is professionally managed by Ashland Pacific Management. Ashland Pacific is an equal opportunity housing provider. We adhere to the Fair Housing Act and all applicable federal, state, and local anti-discrimination laws. We do not discriminate based on race, color, religion, sex, national origin, disability, familial status, sexual orientation, or gender identity. All applicants are subject to our standard Rental Criteria, available upon request, prior to application submission. Come Experience the Ashland Difference, and experience - Life at Ease.\n\n12 Month Lease, Optional Guarantor as needed.",
    "price": 5039,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1245.5 W 37th Dr",
    "distance": 0.5197130514658578,
    "topPicture": "https://photos.zillowstatic.com/fp/19096237ee45d59b05d1aac72370696d-p_b.jpg"
  },
  {
    "description": "**1 BED IN PRIME LOCATION - RIGHT NEXT TO USC - AVAILABLE NOW\n\nThis is a vibrant neighborhood characterized by a mix of cultures, with a significant student population due to its proximity to USC. The area boasts diverse dining options, cultural attractions, and a lively atmosphere, making it a dynamic and exciting place to live.\n\nFeatures:\nStainless Steel Stove/Oven and Refrigerator \nParking Will be Included for +$100\nNatural Light\nModern Bath Fixtures\n\nPlease note: owners will charge the applicable voucher amount.\n\nSquare footage when listed or from inquiry, is approximate*Pricing is subject to change without notice*Pricing can vary between similar apartments for many reasons*Features may vary between similar apartments*Renter to verify all information, including availability*Rental Policy may change without notice*Price breaks are extended to all Applicants, no matter what may have been previously advertised*We adhere to all Fair Housing guidelines and all housing laws",
    "price": 1745,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "3005 S Normandie Ave #6A",
    "distance": 0.9290590805808988,
    "topPicture": "https://photos.zillowstatic.com/fp/488c2ed466fa87b651406706d853a3ac-p_b.jpg"
  },
  {
    "description": "Incredible opportunity to rent a beautifully upgraded, newly furnished house less than a mile from USC, within USC Patrol Zone! Be the first to move into this gorgeous three-bedroom, three-bath home which features a huge wrap-around patio on the first floor, and a second-floor terrace finished with grass turf. Other highlights include brand new appliances, a washer and dryer, and a modern fireplace in the living area. Comes with parking for 3 cars. The home will be available to move in now or for fall 2024 semester. Tenant pays for all utilities and trash. No pets allowed. Security deposit $10,800 + key deposit $100. Submit application with credit report. Won't last long! Contact us today to submit your application!\n\nTenant Pays all utility, No Smoking,",
    "price": 5400,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1438 W 30th St",
    "distance": 0.6851049581506903,
    "topPicture": "https://photos.zillowstatic.com/fp/05603b354c5fe2727fb76c768d7bc6f9-p_b.jpg"
  },
  {
    "description": "Remodeled building with modern design. High ceilings, beautiful plank laminate floor throughout and recessed lighting. Large living room flows right into the kitchen that is fully equipped with stainless steel appliances including, fridge, stove, microwave, dishwasher plus plenty of cabinet space and breakfast bar. Both bedrooms are spacious and bright with ample closet space. Hallway has one full bathroom with bathtub/shower combo, duals sinks. Property is beautifully landscaped and well maintained. 1 Tandem Parking Space (2 cars), Pets ok with additional security deposit & $25/mo. pet rent, laundry on site, all utilities paid by tenant.\n\nNOTE: Westside Property Management does not advertise on CRAIGSLIST or FACEBOOK. \nPLEASE DO NOT SUBMIT AN APPLICATION IF YOU HAVE NOT PERSONALLY VIEWED THE VACANT UNIT | SIGHT UNSEEN APPLICATIONS WILL NOT BE PROCESSED AND WILL BE DENIED. Tenant is required to have renter's insurance and name landlords as additional insured. Condos subject to HOA move-in fee.",
    "price": 2295,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1270 W 39th St #2",
    "distance": 0.9520324656082827,
    "topPicture": "https://photos.zillowstatic.com/fp/607723c94f48dcc913a6c567e1bd9e96-p_b.jpg"
  },
  {
    "description": "Newly built luxurious condo style apartment! Walking distance to Exposition park and USC campus. The unit is located on the 2nd floor of the 2 story building.\nGreat downtown view! Each bedroom is bright and has full bath with well sized walk-in closet. All laminate or tiled floors. All appliance, not only fridge, dishwasher, microwave, oven but washer & dryer in unit! Central A/C and heater are included, too. The rare 3 parking space available - 2 car garage and one more space assigned to this unit. The building is gated for safety. You must see and enjoy convenient living!\n\nCall listing agent for pet!",
    "price": 3500,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "3955 S Budlong Ave #1/2",
    "distance": 0.9136758812042637,
    "topPicture": "https://photos.zillowstatic.com/fp/2fc3d943c3a6fe8a1291decd4396bf15-p_b.jpg"
  },
  {
    "description": "Spacious studio, near to Staple Center!!\n\n**Spacious Studio, Near to Staples Center**\n\nAvailable Now!!\n\nStove\nWall Heating Unit\nStreet Parking Only\n\nMonthly Rent: $2,132\nSecurity Deposit: $2,132 (On Approved Credit)\nMinimum one year Lease required.\n\nSorry, no pets allowed\n\nResident Responsible for: Electricity, Gas, Internet\nLandlord Responsible: Water, Sewer & Trash\n\nStreet Parking\n\nOn-Site Laundry Room\n\n**Resident Benefits Package & Renter's Insurance** \nThe Resident Benefits Package is REQUIRED with all eLAvate lease agreements. The Resident Benefits Package will be billed monthly as one $40.00 charge as additional rent to include the renters insurance benefit and the payment & services benefit. Residents should consult an insurance professional to evaluate and determine personal insurance needs. Residents who provide proof of their own renter's insurance policy that is lease compliant may opt out of the insurance benefit and $10.00 will be deducted from the monthly cost of the Resident Benefits Package. \n \n**Lease Processing Admin Fee** \neLAvate charges a $150.00 non-refundable lease processing administrative fee for all new leases. This covers our cost for providing the service of preparing your online lease agreement for the convenience of electronic signature and setup in our system. \n \nHOW TO APPLY & RENTAL APPLICATION REQUIREMENTS:\n \n*Completed rental application for each prospective resident 18 years of age or older.\n*$50 application fee for each application (cash is not accepted).\n*Valid government issued photo ID.\n*If you are employed: 3 most recent consecutive pay stubs. Partial screenshots, mobile screenshots and monitor screenshots are not accepted. Only full and complete statements are accepted.\n*If you are self-employed: All pages of two years recent PERSONAL tax returns\nand all pages of three months recent PERSONAL bank statements are required. Partial screenshots, mobile screenshots and monitor screenshots are not accepted. Only full and complete statements are accepted.\n\n*KNOW BEFORE YOU APPLY*\n*Please review the Rental application Process & Criteria.\n \nPhotos in this ad are a representation and may not reflect the actual home that is currently available\n \nProfessionally managed by eLAvate, Inc.\n\nIf applicant(s) make any derogatory or offensive comments in any way shape or form either verbally or written, and/or act in a threatening, combative, intoxicated or disorderly manner, during any phase of the application process and lease process the application may be denied. This also applies if the lease has been signed and applicants have not yet taken possession of the home/unit.\n \nEqual Housing Opportunity\n \nEvery effort is made to provide reliable and accurate information. However, changes can and do take place to cause inaccurate information to be inadvertently presented. eLAvate encourages all applicants to verify schools, allowable pets, expected features, or any and all concerns prior to submitting an application and signing a lease agreement. Any information posted on this advertisement does NOT constitute a written agreement or guarantee of the facts stated.\n \nAll application fees are NON-REFUNDABLE",
    "price": 2132,
    "bedrooms": 0,
    "bathrooms": 1,
    "streetAddress": "1046 W Martin Luther King Jr Blvd APT 5",
    "distance": 0.9437982680594312,
    "topPicture": "https://photos.zillowstatic.com/fp/b772a9d10e166a618a33f2e0e2cdbd8b-p_b.jpg"
  },
  {
    "description": "**Beautiful, spacious unit**\n\nBeautiful 1 bedroom apartment unit!\n\nAvailable on/around February 1st, 2024!!\n\n1 Bedroom\n1 Bathroom\nLaminated Floors\nCeiling Fans\nStove\n\nMonthly Rent: $2,407.00\nSecurity Deposit: $2,407.00 (On Approved Credit)\nMinimum one year Lease required.\n\nSorry, no pets allowed\n\nLandlord pays for: WATER & SEWER ONLY\nResident pays for: ELECTRICITY, GAS & TRASH.\n\nParking, please ask\n\nNo Laundry\n\n**Resident Benefits Package & Renter's Insurance**\nThe Resident Benefits Package is REQUIRED with all eLAvate lease agreements. The Resident Benefits Package will be billed monthly as one $40.00 charge as additional rent to include the renters insurance benefit and the payment & services benefit. Residents should consult an insurance professional to evaluate and determine personal insurance needs. Residents who provide proof of their own renter's insurance policy that is lease compliant may opt out of the insurance benefit and $10.00 will be deducted from the monthly cost of the Resident Benefits Package. \n\n**Lease Processing Admin Fee**\neLAvate charges a $150.00 non-refundable lease processing administrative fee for all new leases. This covers our cost for providing the service of preparing your online lease agreement for the convenience of electronic signature and setup in our system.\n\nHOW TO APPLY & RENTAL APPLICATION REQUIREMENTS:\n\n*Completed rental application for each prospective resident 18 years of age or older.\n*$50 application fee for each application (cash is not accepted).\n*Valid government issued photo ID.\n*If you are employed: 3 most recent consecutive pay stubs. Partial screenshots, mobile screenshots and monitor screenshots are not accepted. Only full and complete statements are accepted.\n*If you are self-employed: All pages of two years recent PERSONAL tax returns\nand all pages of three months recent PERSONAL bank statements are required. Partial screenshots, mobile screenshots and monitor screenshots are not accepted. Only full and complete statements are accepted.\n\n*KNOW BEFORE YOU APPLY*\n\n*Please review the Rental application Process & Criteria. \n\nPhotos in this ad are a representation and may not reflect the actual home that is currently available.\n\nProfessionally managed by eLAvate, Inc.\n\nEqual Housing Opportunity\n\nEvery effort is made to provide reliable and accurate information. However, changes can and do take place to cause inaccurate information to be inadvertently presented. eLAvate encourages all applicants to verify schools, allowable pets, expected features, or any and all concerns prior to submitting an application and signing a lease agreement. Any information posted on this advertisement does NOT constitute a written agreement or guarantee of the facts stated.\n\nAll application fees are NON-REFUNDABLE",
    "price": 2407,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1214 W Martin Luther King Blvd #1218-1/4",
    "distance": 1.040814977596776,
    "topPicture": "https://photos.zillowstatic.com/fp/0ac8c61e99277fd60f616b610c1db2c1-p_b.jpg"
  },
  {
    "description": "We have a 1b1b from a 4 bedroom 4 bathroom apartment. We have installed all the furniture for you, including beds and desks, bedside tables, wardrobes. The kitchen is well-installed with kitchen utensils, and the living room has a dining table and sofa are well-prepared. Each room has its own private bathroom, each room is roughly similar, but there are some subtle differences. The bedroom with balcony and bathtub will be slightly more expensive, but the tenant can freely allocate after the whole rent. The elite team of our company boasts both professional consultants for global real-estate and local agents who are experienced at the LA real-estate market, client need and relevant housing policy. To identify the most suitable home for you, we also provide customized service. With our devoted service for house purchasing and leasing, each of our clients is able to enjoy our featured service that is professional, highly efficient, safe and fair. Our house is exactly what you see online!\n\nThis is a COLIVING property, you will have your own bedroom, but you need to share the living room with other tenants. We have installed all the furniture for you, including beds and desks, bedside tables, wardrobes. The kitchen is well-installed with kitchen utensils, and the living room has a dining table and sofa are well-prepared. Each room has its own private bathroom, each room is roughly similar, but there are some subtle differences, the bedroom with balcony and bathtub will be slightly more expensive, but the tenant can freely allocate after the whole rent.",
    "price": 1815,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1340 1/2 W 37th St #3",
    "distance": 0.5632929433891167,
    "topPicture": "https://photos.zillowstatic.com/fp/e06a030d3b76af8c1f9bbc53176e0eb7-p_b.jpg"
  },
  {
    "description": "1151 1/2 W 37th Dr, Fully Furnished 4B4B - Nestled in the USC DPS area, this co-living house offers unparalleled convenience with just a 5-minute walk to the campus. Featuring 4 bedrooms and 4 bathrooms, this residence is fully furnished with essential items such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more, ensuring a hassle-free move-in experience. The common areas and bedrooms are surprisingly spacious, providing residents with ample room to live comfortably. Notable amenities include a dishwasher for added convenience and a bathtub for relaxation. The kitchen is further enhanced with a stylish bar counter. Experience the perfect blend of proximity to USC and the spacious yet cozy design of this 4-bedroom co-living house.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!",
    "price": 7200,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "1151 W 37th Dr #703FA947C",
    "distance": 0.516062781376673,
    "topPicture": "https://photos.zillowstatic.com/fp/eb69389038c0a05e56c195442a83800e-p_b.jpg"
  },
  {
    "description": "Reservation Required.\n\nThis unit is a beautiful one bedroom upstairs unit. The apartment has been completely remodeled! The building is pet friendly and professionally managed. Great for entertaining friends and family. This apartment has new laminated floors, freshly painted, modern ceiling fan, modern bathroom, completely new kitchen and will come with new stainless steel appliances both refrigerator and stove! Must be seen to be appreciated! Parking available upon request. You may visit our website to schedule a tour.",
    "price": 1895,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1345 W 38th St #1347-1/4",
    "distance": 1.0037338110066285,
    "topPicture": "https://photos.zillowstatic.com/fp/7583ebd9c59727067785570ecd0b1661-p_b.jpg"
  },
  {
    "description": "3111 Walton Avenue, 4B4B - Nestled in the USC DPS area, this co-living house offers unparalleled convenience with just a 10-minute walk to the campus. Featuring 4 bedrooms and 4 bathrooms. The common areas and bedrooms are surprisingly spacious, providing residents with ample room to live comfortably. Notable amenities include a dishwasher for added convenience, walk-in closet for extra storage and a bathtub for relaxation Experience the perfect blend of proximity to USC and the spacious yet cozy design of this co-living house.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\"",
    "price": 1600,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "3111 Walton Ave #544B6E7FF",
    "distance": 0.6266534264484219,
    "topPicture": "https://photos.zillowstatic.com/fp/bc8ec7873808b4395cc926f187d4ca91-p_b.jpg"
  },
  {
    "description": "ONE MONTH FREE PROMO\n\nSpacious 3 bed 3 bath House - USC adjacent home in Los Angeles! \n\nThis Beautiful 3 bed, 3 full bath, house built in 2016 has three spacious bedrooms, each bedroom has a full bathroom and spacious closets. The unit has plenty of storage space. If you're looking for a traditional and urban-style home to share with family or roommates, this is the perfect house for you. \n\nKey Features:\n\n1. Bedrooms and Bathrooms: This unit boasts 3 spacious bedrooms and 3 bathrooms to ensure convenience and privacy for all occupants.\n\n2. Gated Access and Parking: Enjoy security and peace of mind with gated access to the property, providing an added layer of safety and privacy.\n\n3. In-Unit Washer and Dryer: Say goodbye to laundromat trips. This unit includes an in-unit washer and dryer, making laundry chores a breeze.\n\n4. Spacious Rooms and Closets: The unit is designed with spacious rooms and ample closet space, ensuring you have plenty of storage for your belongings.\n\n5. Heat/AC: Available in each room.\n\nThe property is in the heart of Los Angeles, very close from USC, the Metro, Downtown LA, Staples Center, LA Live, The Music Center.\n\n**PLEASE NOTE** All Hawk Management residents are enrolled in the Resident Benefits Package (RBP) for $40.95/month which includes renters insurance, credit building to help boost your credit score with timely rent payments, $1M Identity Protection, HVAC air filter delivery (for applicable properties), move-in concierge service making utility connection and home service setup a breeze during your move-in, our best-in-class resident rewards program, and much more! More details upon application.\n\nBroker License: 01924661",
    "price": 3345,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1275 W 39th St #1273-1/2",
    "distance": 0.9548107283714969,
    "topPicture": "https://photos.zillowstatic.com/fp/a482a6ffd75d79ce2ac4880396faf1f1-p_b.jpg"
  },
  {
    "description": "ONE MONTH FREE PROMO\n\nSpacious 3 bed 3 bath House - USC adjacent home in Los Angeles! \n\nThis Beautiful 3 bed, 3 full bath, house built in 2016 has three spacious bedrooms, each bedroom has a full bathroom and spacious closets. The unit has plenty of storage space. If you're looking for a traditional and urban-style home to share with family or roommates, this is the perfect house for you. \n\nKey Features:\n\n1. Bedrooms and Bathrooms: This unit boasts 3 spacious bedrooms and 3 bathrooms to ensure convenience and privacy for all occupants.\n\n2. Gated Access and Parking: Enjoy security and peace of mind with gated access to the property, providing an added layer of safety and privacy.\n\n3. In-Unit Washer and Dryer: Say goodbye to laundromat trips. This unit includes an in-unit washer and dryer, making laundry chores a breeze.\n\n4. Spacious Rooms and Closets: The unit is designed with spacious rooms and ample closet space, ensuring you have plenty of storage for your belongings.\n\n5. Heat/AC: Available in each room.\n\nThe property is in the heart of Los Angeles, very close from USC, the Metro, Downtown LA, Staples Center, LA Live, The Music Center.\n\n**PLEASE NOTE** All Hawk Management residents are enrolled in the Resident Benefits Package (RBP) for $40.95/month which includes renters insurance, credit building to help boost your credit score with timely rent payments, $1M Identity Protection, HVAC air filter delivery (for applicable properties), move-in concierge service making utility connection and home service setup a breeze during your move-in, our best-in-class resident rewards program, and much more! More details upon application.\n\nBroker License: 01924661",
    "price": 3345,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1273 1/2 W 39th St",
    "distance": 0.6659403774728242,
    "topPicture": "https://photos.zillowstatic.com/fp/b807167cef9927e73d7a345617306065-p_b.jpg"
  },
  {
    "description": "3806 S Budlong Ave 4b4b Full furniture - \"Located within 10 min walk to USC, this FULLY-FURNISHED CO-LIVING apartment offers an ideal living space with 4 bedrooms and 4 bathrooms, making it an great choice for those looking to share a living arrangement with friends. Our apartment comes fully furnished with essential items such as beds, desks, kitchen appliances, washer&dryer, living room furnitures and more. Enjoy the abundance of natural light in each room, and experience the convenience of having your own private bedroom and bathroom. Notable features include the presence of a dishwasher in the kitchen, making daily chores hassle-free. Don't miss the opportunity to reside in this well-lit, well-equipped co-living space near USC. \n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!\"",
    "price": 1500,
    "bedrooms": 4,
    "bathrooms": 4,
    "streetAddress": "3806 S Budlong Ave #FA3F8D8E1",
    "distance": 0.7180818779294929,
    "topPicture": "https://photos.zillowstatic.com/fp/3cf01d9635a5a50ff527c84f06cf2a50-p_b.jpg"
  },
  {
    "description": "1340 Fully furnished 6B5B - Just a 10-minute walk from USC, this FULLY FURNISHED co-living house offers a secure and tranquil living experience with 6 bedrooms and 5 bathrooms. Our apartment comes fully furnished with essential items such as beds, desks, kithcen appliances, washer&dryer, living room funitures and more, ensuring a hassle-free move-in experience. The bedrooms are generously spacious, providing you with ample personal space. Notable features include the presence of a dishwasher in the kitchen, making daily chores hassle-free. Experience the convenience of proximity to USC and this well-designed co-living space with generously sized bedrooms.\n\nLeases are available for Fall 2024 Pre-Leasing and special offer is applied to this unit. Contact us today to schedule a tour and secure your new home!",
    "price": 1350,
    "bedrooms": 6,
    "bathrooms": 5,
    "streetAddress": "1340 W 37th St #BE89D87C0",
    "distance": 0.7884081420414462,
    "topPicture": "https://photos.zillowstatic.com/fp/d4642b8ab92ee33bc9456d4991ed91e0-p_b.jpg"
  },
  {
    "description": "Be the first to occupy this newly renovated 2 Bedroom, 2 Bath unit. Your door opens up into a large open living area that then leads you into the kitchen with a beautiful marble island that hosts a brand new dishwasher and is perfect to drag up a few stools and have your little breakfast bar. The kitchen has been fully updated with marble countertops and stainless steel appliances. Down the hallway you'll find the hall bathroom and the first bedroom off to your left with plenty of closet space. The hall bathroom has a beautiful, newly updated shower with wrap around glass paneling, modern fixtures and washer/dryer hook ups. Down the hall you enter the primary suite with a large walk in closet and an en-suite bathroom equipped with a tub and modern fixtures. This neighborhood is very peaceful and there is always ample street parking available. The whole unit has been fully renovated and is waiting for it's first tenants! \nThis is a back unit with 3 other units on the property. No Pets Allowed. Tenant pays $50 per month towards water bill. PLEASE TEXT STEVE FOR SHOWING REQUESTS AND APPLICATIONS.\n\nOwner pays for water and trash. Street parking only. No pets. Washer and dryer hook ups, tenant to supply own washer/dryer. Fridge is not included but owner is open to providing one.",
    "price": 2500,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "1313 W 40th Pl #1/2",
    "distance": 1.1427882031469578,
    "topPicture": "https://photos.zillowstatic.com/fp/62f94775098f2688a2f4fc1acbd7785d-p_b.jpg"
  },
  {
    "description": "Very large and spacious 1 and 3 bedroom apartments available for Fall 2024 Move-In. Hardwood Floors Central Air Conditioning Fridge, Stove, and Dishwasher Washer/Dryer Hook-Ups in the unit Cable Ready and Internet Provided. Utilities provided: Water",
    "price": 3995,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1271-1273 1/2 W 37th Pl #1271",
    "distance": 0.6501618893125275,
    "topPicture": "https://photos.zillowstatic.com/fp/2d13b91fc113591cb03d473d156144f9-p_b.jpg"
  },
  {
    "description": "Gated community located just a five-minute walk from the USC campus. All units are equipped with heating and AC, new appliances, new flooring, recessed lighting, and on-site laundry. Bonus: there are wall-mounted TVs in all living rooms and bedrooms! Property is within the USC Department of Public Safety (DPS) Patrol Zone. DPS patrols the area surrounding USC's University Park Campus 24 hours per day, 7 days a week! If you are one of the many individuals who work, study, or take classes at night, you don't have to walk to your car or home alone. The USC Campus Cruiser Service offers either a walking or vehicle escort to your destination at no cost. Click here for more information. Furnished units available upon request. \n . \n \n Building Amenities: Cats Yes, Dogs Small Only, Covered Parking\n\n Building Appliances: Stove, Refrigerator, Split System A/C (some units), Washer & Dryer (in some units), Dishwasher, Laundry Facilities, TV, Microwave\n.\n Pets: No pets",
    "price": 4000,
    "bedrooms": 3,
    "bathrooms": 1,
    "streetAddress": "1234 W 37th Pl APT 6",
    "distance": 0.6279040420794787,
    "topPicture": "https://photos.zillowstatic.com/fp/083e6edbcb80470e72f8928f8ba07f94-p_b.jpg"
  },
  {
    "description": "3 bedrooms 3 bathroom townhouse located walking distance to USC Campus! Prime Location and close by to DTLA, LA Coliseum, Supermarkets, and many Restaurants. \n\nAMENITIES PROVIDED: Air Conditioning in each room, Hardwood Floors, Natural Stone Countertops, Microwave, Stove, Refrigerator, Dishwasher, Attached 2 Car Garage, Alarm System Connections. NO PETS, NO SMOKING, Utilities not included.\n\nTenant is responsible for all utilities",
    "price": 5400,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1150 W 36th St",
    "distance": 0.46240791198537945,
    "topPicture": "https://photos.zillowstatic.com/fp/1832846aa9bb5e3b7b45f9264a23f980-p_b.jpg"
  },
  {
    "description": "Gated community located just a five-minute walk from the USC campus. All units are equipped with heating and AC, new appliances, new flooring, recessed lighting, and on-site laundry. Bonus: there are wall-mounted TVs in all living rooms and bedrooms! Property is within the USC Department of Public Safety (DPS) Patrol Zone. DPS patrols the area surrounding USC's University Park Campus 24 hours per day, 7 days a week! If you are one of the many individuals who work, study, or take classes at night, you don't have to walk to your car or home alone. The USC Campus Cruiser Service offers either a walking or vehicle escort to your destination at no cost. Click here for more information. Furnished units available upon request. \n . \n \n Building Amenities: Newly Remodeled, Covered Parking (available), Furniture Available, Cats Yes, Dogs Small Only\n\n Building Appliances: Stove, Refrigerator, Microwave, Dishwasher, Split System A/C (some units), TV, Laundry Facilities\n.\n Pets: No pets",
    "price": 2300,
    "bedrooms": 1,
    "bathrooms": 1,
    "streetAddress": "1229 W 37th Pl #4",
    "distance": 0.6095143951636088,
    "topPicture": "https://photos.zillowstatic.com/fp/86e0b20f510a8918e9099c83c8dcd8df-p_b.jpg"
  },
  {
    "description": "This gated community is located just a five-minute walk from the USC campus. All units are equipped with heating and AC, new appliances, new flooring, recessed lighting, and on-site laundry. Bonus: there are wall-mounted TVs in all living rooms and bedrooms! The property is within the USC Department of Public Safety (DPS) Patrol Zone. DPS patrols the area surrounding USC's University Park Campus 24 hours per day, 7 days a week! If you are one of the many individuals who work, study, or take classes at night, you don't have to walk to your car or home alone. The USC Campus Cruiser Service offers either a walking or vehicle escort to your destination at no cost. Click here for more information. Start your journey at the best USC Student Housing option you will find. Furnished units are available upon request. \n . \n \n Building Amenities: Completely Renovated, New Bathrooms, New Flooring, New Blinds, New Lighting, New Tiled Backsplash, TVs in Every Room, Cats Yes, Dogs Small Only, Covered Parking\n\n Building Appliances: Split System A/C (some units), Laundry Facilities, Stove, Refrigerator, TV x 2\n.\n Pets: No pets",
    "price": 2750,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1216 W 37th Pl APT 7",
    "distance": 0.6009501002303076,
    "topPicture": "https://photos.zillowstatic.com/fp/0f9af1ed910b0278cf13d261f1cca978-p_b.jpg"
  },
  {
    "description": "Located near USC campus and within the DPS zone, this property features surveillance cameras and smart locks. Enjoy the convenience of in-unit laundry, fully furnished spaces, and a shuttle bus to USC campus. Plus, manage your living effortlessly with our 24/7 online portal for rent payments and issue reporting. Apply online now if you're ready to secure this modern and secure living space!\n\nLease a private room for the fall and get $500 off! Need an immediate move in? Ask us how to qualify for 2 months free.",
    "price": 1288,
    "bedrooms": 2,
    "bathrooms": 2,
    "streetAddress": "3100 S Normandie Ave",
    "distance": 0.8898702709905796,
    "topPicture": "https://photos.zillowstatic.com/fp/2d98ba6a867d79cd368ba4401def3dab-p_b.jpg"
  },
  {
    "description": "MOVE-IN SPECIAL $500 OFF 1ST MONTH** PRE-LEASING FOR USC FALL SCHOOL SEMESTER 2024/2025\n\nAvailable to rent for a group of friends OR per person private room/Co-living!\n *List price is for entire house. \nWelcome to this super charming, private free standing renovated 4-Bedroom House - only 2 Blocks from USC, Walk, bike or E scooter cruise to campus. DPS patrol zone area. This home is equipped with stainless-steel kitchen appliances such as dishwasher, stove range oven and refrigerator.. washer/dryer. The house has one bathroom with multiple showers and sinks, main floor has 3 bedrooms and a large upstair bedroom/loft. Additionally, each room is provided with its individual key for privacy. \n You can use online portal to pay rent and report issues 24/7. \n**Call or Text me with any questions or addition information on Per Person room pricing. \n** Schedule your tour today!\n\nKEY FEATURES:\nRent: $5,200 - **MOVE IN SPECIAL**\nLease Term: August 1, 2024 - July 23, 2025\nSq Footage: About 1400 sq ft. \nBedrooms: 4 Beds\nBathrooms: 1 Bath\nParking: On-Site Parking\nDeposit: Depends on Credit History\nPet Policy: No Pets Allowed\nProperty Type: Single Family House\n\nDESCRIPTION:\nSpacious and Remodeled 4-Bedroom House 2-blocks from USC Campus. Live in a stylish designer house near campus and enjoy your experience!\n\nNEW INTERIORS:\nBright & Attractive with Lots of Natural Light\nNew Bathroom & Shower\nSpacious Living Area and Kitchen\n\nRENTAL FEATURES\nLiving room\nStorage space\nRange / Oven\nRefrigerator included\nDishwasher included\nGarbage disposal\nStainless steel appliances\nYard\nPorch\nAir conditioning\nHardwood floor\nTile floor\nGranite counter top\nHigh / Vaulted ceiling\nSkylights\nParking Included\n\nCOMMUNITY FEATURES\nGated entry\n\nOne Year Lease as of 8/1/2024.\n\nTenant pays for all utilities.",
    "price": 5200,
    "bedrooms": 4,
    "bathrooms": 1,
    "streetAddress": "3425 Walton Ave #3425",
    "distance": 0.5975745540955072,
    "topPicture": "https://photos.zillowstatic.com/fp/3fe75a385247ec5cef62069981813508-p_b.jpg"
  },
  {
    "description": "This is a new exquisite apartment located only blocks away from campus. Great option for groups! Pricing is for entire unit. It's within DPS patrol and free Lyft area. 9 mins walking distance to campus. The building is equipped with smart lock, which creates a safe living environment for you. All units come fully furnished In-unit washer/dryer. Within the DPS and Free Lyft area. An online portal to pay rent or report issues 24/7. If you're interested, please apply online now.",
    "price": 1000,
    "bedrooms": 4,
    "bathrooms": 3,
    "streetAddress": "1259 W 36th Pl #74F87374",
    "distance": 0.6506713726048811,
    "topPicture": "https://photos.zillowstatic.com/fp/81d824de637e6870866bc90632ddb5ec-p_b.jpg"
  },
  {
    "description": "Unmatched Location Benefits: . Proximity to USC: Enjoy a short 2-minute walk to campus, ensuring you're always within reach of classes,\nlibraries, and campus events.\n. DPS Patrol &amp; Campus Cruiser Range: Situated within the university's safety patrol boundaries (less than a\nblock from campus) for added peace of mind. Exceptional Home Features\n. Spacious Living: The 3-bed, 3-bath layout is perfect for students looking for a room to study, relax and\nconnect with housemates. Each of these colossal bedrooms can easily fit two queen-sized beds and desks and a\ndresser with walk-in closets.\n. Modern amenities: Experience the convenience of modern living with granite countertops, hardwood flooring,\nand top-tier kitchen appliances including a stove refrigerator, microwave, and dishwasher.\n. Designed for Students: From in-house laundry facilities to central air conditioning, keyless doors, and the\nsafety of your car parked in your private attached garage should bring you peace of mind.\n. Outdoor spaces: The front lawn in this gated community and benches in the common area allow you to bask in\nthe sun while studying and getting ready for the midterm. Why 1138 West 36 th Street is an ideal Student Home?\n. Convenience: Tailored amenities like in-house laundry and modern kitchen appliances make daily living\neffortless.\n. Safety: Gated access, surveillance cameras, and video doorbells, ensure a secure environment for you and your\npeers.\n. Comfort: Air-conditioned interior and spacious living area and bedrooms provide a comfortable retreat from\nyour busy college schedule.\n. Community: Positioned in a lively neighborhood close to USC, this home is perfect for students eager to\nengage with campus life and beyond.\n. Meow, Meow! Woof Woof: We love our Fairy friends (Breed &amp; Weight restriction) Secure your place in this premier USC adjacent Housing! Lease Terms:\n. An 11.5-month lease is preferred.\n. Security deposit is due at signing. Ask us\nabout our SPECIALS.. \n . \n \n Building Amenities: New Flooring, New Appliances, TVs Included, Multi-Car Garage, Landscaped Lawn, Outdoor Patio, Campus Security, Keypad Entry, In-Unit Laundry, Cats Yes, In-Unit Washer & Dryer, Covered parking, Private Master Bathrooms, Central Heating and Air conditioning, Spacious Modern kitchen, Dogs-OK. Breed and weight restriction\n.\n Pets: No pets",
    "price": 5500,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "1136 W 36th St #1136",
    "distance": 0.44277479779264994,
    "topPicture": "https://photos.zillowstatic.com/fp/34217821768869fa849c4328a3771895-p_b.jpg"
  },
  {
    "description": "KEY FEATURES:\nRent: $3950 - $4200 depend on unit size \nBedrooms: 3 Bedrooms\nBathrooms: 3 or 2 Bathrooms \nLease Duration: August 1, 2024 - July 23, 2025\nParking: On-Site Parking Available\nDeposit: Depends on Credit History\nPet Policy: No Pets Allowed\nLaundry: Yes - Washer/Dryer in Unit\nUnits are not furnished.\nOwner pays for internet. Tenant pays for gas, electricity, & trash - either paid directly or as a reimbursement to owner.\n\nDESCRIPTION:\nSpacious and Newly Remodeled 3-Bedroom Apartments 2-blocks from USC Campus. Live in a stylish designer house near campus and enjoy your experience!\n\nNEW INTERIORS:\n-Large Bedrooms -- Ideal for 2 twin size beds (approximately 125 sf - the same size as at the Lorenzo or comparable properties) and one smaller bedroom (appx 100 sf) ideal for a single twin/full bed.\n-Bright & Attractive with Lots of Natural Light\n-New: Hardwood Floors & Tile Kitchen & Bath with New Cabinets & \nQuartz Countertops\n-New: Stainless Steel Appliances -- Stove, Refrigerator, Dishwasher, Washer/Dryer\n-New: Bathroom & Showers\n-Individual AC in Each Bedroom\n\nCOMMUNITY FEATURES:\nGated entry\nNew Landscaping\n\nLEASE TERMS:\n$35 Application fee\n\nLOCATION:\n2 Blocks from Campus, within the USC DPS Security Zone",
    "price": 3950,
    "bedrooms": 3,
    "bathrooms": 3,
    "streetAddress": "3410 Walton Ave",
    "distance": 0.5822126233680284,
    "topPicture": "https://photos.zillowstatic.com/fp/5ab6a54b790a35a631ad8ab8d0fa4903-p_b.jpg"
  },
  {
    "description": "Next to the Expo/Vermont Metro Station and USC!! GATED Community 2 bedroom 1 bath REMODELED unit with GATED PARKING\n City living with driving option. Unit also includes Dishwasher, Range, Microwave Air Conditioners!.This one won't last!! For more properties like this visit Affordable Housing.",
    "price": 2250,
    "bedrooms": 2,
    "bathrooms": 1,
    "streetAddress": "1124 W 38th St APT 1",
    "distance": 0.6883317298910173,
    "topPicture": "https://photos.zillowstatic.com/fp/f0cd3c73ceba651c1a50de6f379afcdb-p_b.jpg"
  },
  {
    "description": "We are pleased to offer large, recently renovated luxury town homes just two blocks from the University of Southern California. Each spacious 1200 square foot floor plan features a full kitchen with granite countertops and stainless steel appliances, two master suites with attached bath, downstairs guest bath, central air conditioning, private outdoor space, easy onsite laundry and optional subterranean gated parking. This well maintained gated community is situated in North University Park, within USC's Department of Public Safety (DPS) patrol boundaries. Our residents enjoy an easy 5 to 10 minute walk or bike ride to campus! Sorry, No Pets Allowed. \n . \n \n Building Amenities: Central Heating and Air Conditioning, Walk to USC Campus, Two Spacious Bedrooms with Attached Bath, Third Guest Bath Downstairs, High-End Kitchens with Granite Counters and Stainless Steel Appliances, Tile Flooring, Extra Storage Closets, 24 Hour Maintenance Emergency Line, Constructed in 2003, Free Cable and Internet, USC Tram Stop Nearby, Within D.P.S. Safety Patrol Boundries, Walk to Fraternity/Sorority Row, Landscaping, On-Site Laundry Facility, Attached Garage\n\n Unit Appliances: All Stainless Steel Appliances, Refrigerator, Built-in Microwave, Garbage Disposal\n.\n Pets: No pets\n\n IT490425 - IT49ism123640f9c8c22245e81d05c4335",
    "price": 4095,
    "bedrooms": 2,
    "bathrooms": 2.5,
    "streetAddress": "1239 W 30th St APT 1",
    "distance": 0.46082724169809725,
    "topPicture": "https://photos.zillowstatic.com/fp/439335b3180e3b233cfbfa5bebc0c4b1-p_b.jpg"
  }
]